IDENTIFICATION DIVISION.
       PROGRAM-ID. FIZZBUZZ100.

       ENVIRONMENT DIVISION.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 START_NUM VALUE 1.
       01 END_NUM VALUE 100.
       
       PROCEDURE DIVISION.

       PERFORM 1000-PROCESS-NUMBER 100 TIMES
       DISPLAY CURRENT 
       DISPLAY CURRENT-RESULT
       END PROGRAM FIZZBUZZ100.