           TESTSUITE 'UNIT TESTS FOR FIZZBUZZ.CBL'

           TESTCASE 'IT RETURNS FIZZ FOR THE NUMBER 3 (DIVISIBLE BY 3)'
           MOVE 3 TO CURRENT
           PERFORM 1000-PROCESS-NUMBER
           EXPECT CURRENT-RESULT TO BE "FIZZ"

           TESTCASE 'IT RETURNS BUZZ FOR THE NUMBER 5 (DIVISIBLE BY 5)'
           MOVE 5 TO CURRENT
           PERFORM 1000-PROCESS-NUMBER
           EXPECT CURRENT-RESULT TO BE "BUZZ"

           TESTCASE 'IT RETURNS FIZZBUZZ FOR THE NUMBER 15 (BY 3 AND 5)'
           MOVE 15 TO CURRENT
           PERFORM 1000-PROCESS-NUMBER
           EXPECT CURRENT-RESULT TO BE "FIZZBUZZ"

           TESTCASE 'IT RETURNS "" FOR THE NUMBER 8 (NEITHER 3 NOR 5)'
           MOVE 8 TO CURRENT
           PERFORM 1000-PROCESS-NUMBER
           EXPECT CURRENT-RESULT TO BE ""
